-- SQLBook: Code
-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        10.11.1-MariaDB - mariadb.org binary distribution
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  12.4.0.6659
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- 테이블 team03.membertable 구조 내보내기
CREATE TABLE IF NOT EXISTS `membertable` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `phoneNumber` char(20) NOT NULL,
  `point` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `phoneNumber` (`phoneNumber`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- 테이블 데이터 team03.membertable:~2 rows (대략적) 내보내기
INSERT INTO `membertable` (`id`, `phoneNumber`, `point`) VALUES
	(0, '1234', 0),
	(1, '010-9500-9987', 99999999);

-- 테이블 team03.menutable 구조 내보내기
CREATE TABLE IF NOT EXISTS `menutable` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `foodType` int(11) NOT NULL,
  `imgUrl` varchar(255) NOT NULL,
  `foodTitle` varchar(255) NOT NULL,
  `foodDesc` text NOT NULL,
  `foodInfo` text NOT NULL,
  `allergyInfo` text NOT NULL,
  `foodTop` tinyint(1) NOT NULL,
  `foodPrice` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=50 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- 테이블 데이터 team03.menutable:~49 rows (대략적) 내보내기
INSERT INTO `menutable` (`id`, `foodType`, `imgUrl`, `foodTitle`, `foodDesc`, `foodInfo`, `allergyInfo`, `foodTop`, `foodPrice`) VALUES
	(1, 1, '1.png', '도리텐정식', '(일본식 닭튀김) 미야자키 명물', '닭고기, 명란젓, 계란, 장국', '닭고기, 명란젓, 계란', 1, 10000),
	(2, 1, '2.png', '민치카츠 정식', '부드러운 민치 돈까스', '돼지고기, 명란젓, 계란', '돼지고기, 명란젓, 계란', 1, 14000),
	(3, 1, '3.png', '치킨그릴 정식', '닭다리살로 만든 치킨스테이크', '닭고기, 명란젓, 계란, 장국', '닭고기, 명란젓, 계란', 1, 10000),
	(4, 1, '4.png', '믹스 후라이 정식', '기본 등심카츠, 새우, 게맛살, 고로케', '돼지고기, 새우, 게, 명란젓, 계란, 장국', '돼지고기, 명란젓, 갑각류, 계란', 1, 14000),
	(5, 1, '5.png', '치킨 난반 정식', '닭튀김에 새콤한 난반 소스 + 타르타르 소스', '닭고기, 명란젓, 계란, 장국', '연어, 명란젓, 계란', 1, 12000),
	(6, 1, '6.png', '큐브스테이크 정식', '블랙앵거스 초이스급 소고기', '소고기, 명란젓, 계란, 장국', '소고기, 명란젓, 계란', 0, 16000),
	(7, 1, '7.png', '쇼가야키 정식', '부드러운 돼지 목살 + 생강소스의 만남', '돼지고기, 명란젓, 계란, 장국', '돼지고기, 명란젓, 계란', 0, 16000),
	(8, 1, '8.png', '화로구이 정식', '와규 프라임급 진갈비', '소고기, 명란젓, 계란, 장국', '소고기, 명란젓, 계란', 0, 16000),
	(9, 1, '9.png', '함박 그릴 정식', '특제 데미그라스 소스', '소고기, 명란젓, 계란, 장국', '소고기, 명란젓, 계란', 0, 14000),
	(10, 1, '10.png', '스키야키 정식', '일본식 소고기 전골 요리(날계란 유자폰즈 소스)', '소고기, 버섯, 명란젓, 계란, 장국', '소고기, 버섯, 명란젓, 계란', 0, 18000),
	(11, 1, '11.png', '연어회 정식', '부드러운 식감 숙성 연어', '연어, 명란젓, 계란, 장국', '연어, 명란젓, 계란', 0, 13000),
	(12, 1, '12.png', '호르몬그릴 정식', '큐슈풍 칠리소스 곱창볶음요리', '소고기, 곱창, 명란젓, 계란, 장국', '소고기, 명란젓, 계란', 0, 18000),
	(13, 1, '13.png', '호르몬 모츠나베 정식', '후쿠오카식 곱창 전골 요리', '소고기, 명란젓, 계란', '소고기, 명란젓, 계란', 0, 18000),
	(14, 1, '14.png', '붕장어구이 정식', '달콤한 특제 데리아끼소스', '붕장어, 명란젓, 계란, 장국', '생선, 명란젓, 계란', 0, 14000),
	(15, 1, '15.png', '생선구이 정식', '고등어 생선 구이', '고등어, 명란젓, 계란, 장국', '생선, 명란젓, 계란', 0, 14000),
	(16, 1, '16.png', '본카레 정식', '맛있는 일본식 카레', '돼지고기, 명란젓, 계란, 장국', '돼지고기, 강황, 명란젓, 계란', 0, 16000),
	(17, 1, '17.png', '스테미너 낫토 정식', '건강에 좋은 영양만점 낫토', '낫토, 명란젓, 계란, 장국', '낫토, 명란젓, 계란', 0, 14000),
	(18, 1, '18.png', '사오리(학꽁치)튀김', '학꽁치, 명란젓, 계란, 장국', '생선, 명란젓, 계란', '18. ( 메인 >> 닭고기 알레르기 / / 기본적인 밑반찬 > >명란젓 // 조각 계란찜', 0, 14000),
	(19, 1, '19.png', '키즈정식', '어린이 정식 세트', '돼지고기, 명란젓, 계란, 장국', '돼지고기, 명란젓, 계란', 0, 9000),
	(20, 2, '1.png', '나가사키 해물라멘', '일본식 하얀 해물라면', '밀가루, 새우, 배추, 당근, 버섯, 조개', '새우, 조개, 밀가루', 0, 17000),
	(21, 2, '2.png', '삿뽀로 미소라멘', '미소를 사용한 라멘', '숙주, 돼지고기, 파, 토란, 미소', '돼지고기', 0, 13000),
	(22, 3, '1.png', '쇼가야키', '부드러운 돼지 목살 + 생강소스의 만남', '돼지고기, 생강, 무순, 양파, 방울토마토', '돼지고기', 0, 17000),
	(23, 3, '2.png', '치킨그릴', '구운 닭고기', '닭고기, 계란, 방울토마토, 소시지, 완두콩, 감자, 밀가루', '닭고기, 계란, 소시지, 밀가루', 0, 17000),
	(24, 3, '3.png', '화로구이 8~10P', '화로에 구워먹는 소고기', '레몬, 소고기', '소고기', 0, 17000),
	(25, 3, '4.png', '붕장어', '고추장 양념에 버무린 붕장어구이', '무순, 레몬, 생강, 붕장어, 고추장', '붕장어', 0, 17000),
	(26, 3, '5.png', '연어사시미', '노르웨이 생 연어회', '생강, 연어, 무순, 와사비, 레몬', '연어', 0, 17000),
	(27, 3, '6.png', '치킨난반', '튀긴 닭고기', '레몬, 닭고기, 양배추, 치커리, 밀가루, 계란', '밀가루, 닭고기, 계란', 0, 17000),
	(28, 3, '7.png', '스위트포테이토', '고구마 튀김', '고구마, 밀가루, 계란', '밀가루, 계란', 0, 17000),
	(29, 3, '8.png', '시샤모', '말린 별빙어', '빙어, 상추, 레몬', '빙어', 0, 17000),
	(30, 3, '9.png', '치킨가라아게', '전분을 얇게 입혀 튀긴 닭고기', '양배추, 치커리, 닭고기, 레몬, 전분, 계란, 마요소스', '닭고기, 계란', 0, 17000),
	(31, 3, '10.png', '스키야키', '얇게 저민 고기와 채소를 삶은 요리', '소고기, 버섯, 배추, 어묵, 만두, 양배추', '소고기, 어묵, 만두', 0, 17000),
	(32, 3, '11.png', '믹스후라이', '모듬 튀김', '치커리, 레몬, 새우, 숙주, 닭고기, 양파, 밀가루, 돼지고기, 감자', '닭고기, 밀가루, 새우, 돼지고기, 감자', 0, 17000),
	(33, 3, '12.png', '민치카츠', '다진 고기를 사용한 튀김옷 커틀릿', '돼지고기, 소고기, 밀가루, 계란, 레몬, 치커리, 숙주', '돼지고기, 소고기, 밀가루, 계란', 0, 17000),
	(34, 3, '13.png', '감자고로케', '으깬 감자에 양파를 넣어 튀킨 고로케,바삭하고 담백한 튀긴 으깬감자', '감자, 당근, 양파, 치즈, 밀가루, 빵가루, 계란, 파슬리', '치즈, 계란, 밀가루, 빵가루', 0, 17000),
	(35, 3, '14.png', '스노우크랩', '대게 튀김', '밀가루, 계란, 대게', '밀가루, 계란, 대게', 0, 17000),
	(36, 3, '15.png', '스테미너 낫토', '낫토균을 이용해 발효시킨 콩', '낫토, 계란, 무순, 고추', '계란', 0, 17000),
	(37, 3, '16.png', '호르몬 모츠나베', '곱창전골', '돼지 내장, 배추, 부추, 어묵, 숙주, 고추', '돼지 내장, 어묵', 0, 17000),
	(38, 3, '17.png', '연어구이', '노르웨이 연어 구이', '연어, 레몬, 생강', '연어', 0, 17000),
	(39, 3, '18.png', '고등어구이 1/2', '소금에 절인 고등어구이', '고등어', '고등어', 0, 17000),
	(40, 4, '1.png', '콜라', '맛있는 코카콜라', '콜라', '콜라', 0, 17000),
	(41, 4, '2.png', '사이다', '스프라이트', '사이다', '사이다', 0, 17000),
	(42, 4, '3.png', '닥터페퍼', '>_< 닥터테퍼 사랑행', '닥터페퍼', '닥터페퍼', 0, 17000),
	(43, 4, '4.png', '환타', '환타', '환타', '환타', 0, 17000),
	(44, 5, '1.png', '일본주', '일본주', '일본주', '일본주', 0, 100000),
	(45, 5, '2.png', '사케', '사케', '사케', '사케', 0, 100000),
	(46, 5, '3.png', '아사히 생맥주', '아사히 비루', '맥주', '맥주', 0, 6000),
	(47, 5, '4.png', '산토리 하이볼', '자파니즈 위스키 하이볼', '하이볼', '하이볼', 0, 8000),
	(48, 5, '5.png', '한라산 소주', '할아버지가 좋아하는 소주', '소주', '소주', 0, 4500),
	(49, 5, '6.png', '산토리 위스키', '자파니즈 위스키 >_<~!', '위스키', '위스키', 0, 240000);

-- 테이블 team03.ordertable 구조 내보내기
CREATE TABLE IF NOT EXISTS `ordertable` (
  `orderNumber` int(11) NOT NULL AUTO_INCREMENT,
  `orderHistory` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL CHECK (json_valid(`orderHistory`)),
  `membershipNumber` char(20) DEFAULT NULL,
  `orderTime` datetime NOT NULL,
  `totalPrice` int(11) NOT NULL,
  PRIMARY KEY (`orderNumber`),
  KEY `membershipNumber` (`membershipNumber`),
  CONSTRAINT `ordertable_ibfk_1` FOREIGN KEY (`membershipNumber`) REFERENCES `membertable` (`phoneNumber`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- 테이블 데이터 team03.ordertable:~3 rows (대략적) 내보내기
INSERT INTO `ordertable` (`orderNumber`, `orderHistory`, `membershipNumber`, `orderTime`, `totalPrice`) VALUES
	(1, '[1, 1, 1, 2, 3]', '010-9500-9987', '2023-03-30 00:00:00', 1000),
	(2, '[3, 3, 3]', NULL, '2023-03-30 00:00:00', 2000),
	(3, '[5, 6, 6]', NULL, '2023-03-30 00:00:00', 20000);

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
