-- Active: 1675230299476@@127.0.0.1@3306@c17st11
CREATE TABLE
	IF NOT EXISTS `membertable` (
		`id` int (11) NOT NULL AUTO_INCREMENT,
		`phoneNumber` char(20) DEFAULT NULL,
		`point` int (11) DEFAULT NULL,
		PRIMARY KEY (`id`),
		UNIQUE KEY `phoneNumber` (`phoneNumber`)
	) ENGINE = InnoDB AUTO_INCREMENT = 201 DEFAULT CHARSET = utf8mb4 COLLATE = utf8mb4_general_ci;

INSERT INTO
	`membertable` (`id`, `phoneNumber`, `point`)
VALUES
	(0, '1234', 0),
	(1, '010-9500-9987', 99566738),
	(2, '010-1111-1111', 2000),
	(3, '010-2222-2222', 2133712),
	(4, '010-6523-4895', 0),
	(5, '010-5264-2312', 0),
	(6, '010-3689-3269', 0),
	(8, '010-5555-5555', 1000),
	(11, '010-8888-8888', 0),
	(16, '010-8523-6987', 0),
	(48, '070-2222-5555', 0),
	(49, '010-3333-5555', 4000),
	(142, '010-6216-3523', -9999999),
	(160, '010-3333-3333', 0),
	(171, '669-9999-9996', 0),
	(174, '010-6658-7777', 0);

CREATE TABLE
	IF NOT EXISTS `menutable` (
		`id` int (11) NOT NULL AUTO_INCREMENT,
		`foodType` int (11) NOT NULL,
		`imgUrl` varchar(255) NOT NULL,
		`foodTitle` varchar(255) NOT NULL,
		`foodDesc` text DEFAULT NULL,
		`foodInfo` text DEFAULT NULL,
		`allergyInfo` text DEFAULT NULL,
		`foodTop` tinyint (1) NOT NULL,
		`foodPrice` int (11) NOT NULL,
		`foodSpicy` tinyint (1) DEFAULT NULL,
		PRIMARY KEY (`id`)
	) ENGINE = InnoDB AUTO_INCREMENT = 50 DEFAULT CHARSET = utf8mb4 COLLATE = utf8mb4_general_ci;

INSERT INTO
	`menutable` (
		`id`,
		`foodType`,
		`imgUrl`,
		`foodTitle`,
		`foodDesc`,
		`foodInfo`,
		`allergyInfo`,
		`foodTop`,
		`foodPrice`,
		`foodSpicy`
	)
VALUES
	(
		1,
		1,
		'1.png',
		'도리텐 정식',
		'미야자키 명물 일본식 닭튀김 (650 kcal)',
		'닭고기, 명란젓, 계란, 장국',
		'닭고기, 계란, 밀가루',
		1,
		10000,
		NULL
	),
	(
		2,
		1,
		'2.png',
		'민치카츠 정식',
		'부드러운 민치 돈까스 (568 kcal)',
		'돼지고기, 명란젓, 계란',
		'돼지고기, 계란, 밀가루',
		1,
		14000,
		NULL
	),
	(
		3,
		1,
		'3.png',
		'치킨그릴 정식',
		'닭다리살로 만든 치킨스테이크 (570 kcal)',
		'닭고기, 명란젓, 계란, 장국',
		'닭고기, 계란, 밀가루',
		1,
		10000,
		NULL
	),
	(
		4,
		1,
		'4.png',
		'믹스 후라이 정식',
		'기본 등심카츠, 새우, 게맛살, 고로케 (678 kcal)',
		'돼지고기, 새우, 게, 명란젓, 계란, 장국',
		'돼지고기, 새우, 게, 계란, 밀가루',
		1,
		14000,
		NULL
	),
	(
		5,
		1,
		'5.png',
		'치킨 난반 정식',
		'닭튀김에 새콤한 난반 소스 + 타르타르 소스 (725 kcal)',
		'닭고기, 명란젓, 계란, 장국',
		'계란, 밀가루',
		1,
		12000,
		NULL
	),
	(
		6,
		1,
		'6.png',
		'큐브스테이크 정식',
		'블랙앵거스 초이스급 소고기 (679 kcal)',
		'쇠고기, 명란젓, 계란, 장국',
		'쇠고기, 계란',
		0,
		16000,
		NULL
	),
	(
		7,
		1,
		'7.png',
		'쇼가야키 정식',
		'부드러운 돼지 목살 + 생강소스의 만남 (689 kcal)',
		'돼지고기, 명란젓, 계란, 장국',
		'돼지고기, 계란',
		0,
		16000,
		1
	),
	(
		8,
		1,
		'8.png',
		'화로구이 정식',
		'와규 프라임급 진갈비 (632 kcal)',
		'쇠고기, 명란젓, 계란, 장국',
		'쇠고기, 계란',
		0,
		16000,
		NULL
	),
	(
		9,
		1,
		'9.png',
		'함박 그릴 정식',
		'특제 데미그라스 소스 (686 kcal)',
		'쇠고기, 명란젓, 계란, 장국',
		'쇠고기, 계란, 밀가루',
		0,
		14000,
		NULL
	),
	(
		10,
		1,
		'10.png',
		'스키야키 정식',
		'일본식 쇠고기 전골 요리(날계란 유자폰즈 소스) (403 kcal)',
		'쇠고기, 버섯, 명란젓, 계란, 장국',
		'쇠고기, 계란',
		0,
		18000,
		NULL
	),
	(
		11,
		1,
		'11.png',
		'연어회 정식',
		'부드러운 식감 숙성 연어 (655 kcal)',
		'연어, 명란젓, 계란, 장국',
		'계란',
		0,
		13000,
		NULL
	),
	(
		12,
		1,
		'12.png',
		'호르몬그릴 정식',
		'큐슈풍 칠리소스 곱창볶음요리 (778 kcal)',
		'쇠고기, 곱창, 명란젓, 계란, 장국',
		'쇠고기, 계란',
		0,
		18000,
		NULL
	),
	(
		13,
		1,
		'13.png',
		'호르몬 모츠나베 정식',
		'후쿠오카식 곱창 전골 요리 (688 kcal)',
		'쇠고기, 명란젓, 계란',
		'쇠고기, 계란',
		0,
		18000,
		NULL
	),
	(
		14,
		1,
		'14.png',
		'붕장어구이 정식',
		'달콤한 특제 데리아끼소스 (423 kcal)',
		'붕장어, 명란젓, 계란, 장국',
		'계란',
		0,
		14000,
		NULL
	),
	(
		15,
		1,
		'15.png',
		'생선구이 정식',
		'고등어 생선 구이 (271 kcal)',
		'고등어, 명란젓, 계란, 장국',
		'고등어, 계란',
		0,
		14000,
		NULL
	),
	(
		16,
		1,
		'16.png',
		'본카레 정식',
		'맛있는 일본식 카레 (434 kcal)',
		'돼지고기, 명란젓, 계란, 장국',
		'돼지고기, 계란',
		0,
		16000,
		1
	),
	(
		17,
		1,
		'17.png',
		'스테미너 낫토 정식',
		'건강에 좋은 영양만점 낫토 (417 kcal)',
		'낫토, 명란젓, 계란, 장국',
		'계란',
		0,
		14000,
		NULL
	),
	(
		18,
		1,
		'18.png',
		'사오리(학꽁치)튀김',
		'학꽁치, 명란젓, 계란, 장국 (357 kcal)',
		'생선, 명란젓, 계란',
		'계란, 밀가루',
		0,
		14000,
		NULL
	),
	(
		19,
		1,
		'19.png',
		'키즈정식',
		'어린이 정식 세트 (412 kcal)',
		'돼지고기, 명란젓, 계란, 장국',
		'돼지고기, 계란',
		0,
		9000,
		NULL
	),
	(
		20,
		2,
		'1.png',
		'나가사키 해물라멘',
		'일본식 하얀 해물라면 (687 kcal)',
		'밀가루, 새우, 배추, 당근, 버섯, 조개',
		'새우, 조개, 밀가루',
		0,
		10000,
		NULL
	),
	(
		21,
		2,
		'2.png',
		'삿뽀로 미소라멘',
		'된장을 베이스로 만든 라멘 (587 kcal)',
		'숙주, 돼지고기, 파, 토란, 미소',
		'돼지고기, 밀가루',
		0,
		8000,
		NULL
	),
	(
		22,
		3,
		'1.png',
		'쇼가야키',
		'부드러운 돼지 목살 + 생강소스의 만남 (550 kcal)',
		'돼지고기, 생강, 무순, 양파, 방울토마토',
		'돼지고기',
		0,
		8000,
		NULL
	),
	(
		23,
		3,
		'2.png',
		'치킨그릴',
		'그릴에 구운 닭고기와 감자튀김 (557 kcal)',
		'닭고기, 계란, 방울토마토, 소시지, 완두콩, 감자, 밀가루',
		'닭고기, 계란, 소시지, 밀가루',
		0,
		8000,
		NULL
	),
	(
		24,
		3,
		'3.png',
		'화로구이 8~10P',
		'화로에 구워먹는 쇠고기 (607 kcal)',
		'레몬, 소고기',
		'쇠고기',
		0,
		16000,
		NULL
	),
	(
		25,
		3,
		'4.png',
		'붕장어',
		'고추장 양념에 버무린 붕장어구이 (472 kcal)',
		'무순, 레몬, 생강, 붕장어, 고추장',
		'계란',
		0,
		10000,
		NULL
	),
	(
		26,
		3,
		'5.png',
		'연어사시미',
		'노르웨이 생 연어회 (560 kcal)',
		'생강, 연어, 무순, 와사비, 레몬',
		'계란',
		0,
		13000,
		NULL
	),
	(
		27,
		3,
		'6.png',
		'치킨난반',
		'저온 기름에 튀긴 닭고기 (645 kcal)',
		'레몬, 닭고기, 양배추, 치커리, 밀가루, 계란',
		'밀가루, 닭고기, 계란',
		0,
		8000,
		NULL
	),
	(
		28,
		3,
		'7.png',
		'스위트포테이토',
		'달달한 고구마 튀김 (312 kcal)',
		'고구마, 밀가루, 계란',
		'밀가루, 계란',
		0,
		7000,
		NULL
	),
	(
		29,
		3,
		'8.png',
		'시샤모',
		'말린 별빙어 (312 kcal)',
		'빙어, 상추, 레몬',
		'고등어',
		0,
		10000,
		NULL
	),
	(
		30,
		3,
		'9.png',
		'치킨가라아게',
		'전분을 얇게 입혀 튀긴 닭고기 (458 kcal)',
		'양배추, 치커리, 닭고기, 레몬, 전분, 계란, 마요소스',
		'닭고기, 계란',
		0,
		8000,
		NULL
	),
	(
		31,
		3,
		'10.png',
		'스키야키',
		'얇게 저민 고기와 채소를 삶은 요리 (650 kcal)',
		'쇠고기, 버섯, 배추, 어묵, 만두, 양배추',
		'쇠고기',
		0,
		8000,
		NULL
	),
	(
		32,
		3,
		'11.png',
		'믹스후라이',
		'새우튀김 + 닭고기 튀김 + 돼지고기 튀김 (655 kcal)',
		'치커리, 레몬, 새우, 숙주, 닭고기, 양파, 밀가루, 돼지고기, 감자',
		'닭고기, 밀가루, 새우, 돼지고기',
		0,
		8000,
		NULL
	),
	(
		33,
		3,
		'12.png',
		'민치카츠',
		'다진 고기를 사용한 튀김옷 커틀릿 (786 kcal)',
		'돼지고기, 쇠고기, 밀가루, 계란, 레몬, 치커리, 숙주',
		'돼지고기, 쇠고기, 밀가루, 계란',
		0,
		7000,
		NULL
	),
	(
		34,
		3,
		'13.png',
		'감자고로케',
		'으깬 감자에 양파를 넣어 튀킨 고로케 (315 kcal)',
		'감자, 당근, 양파, 치즈, 밀가루, 빵가루, 계란, 파슬리',
		'치즈, 계란, 밀가루',
		0,
		4000,
		NULL
	),
	(
		35,
		3,
		'14.png',
		'스노우크랩',
		'대게 튀김 (456 kcal)',
		'밀가루, 계란, 대게',
		'밀가루, 계란, 게',
		0,
		12000,
		NULL
	),
	(
		36,
		3,
		'15.png',
		'스테미너 낫토',
		'낫토균을 이용해 발효시킨 콩 (312 kcal)',
		'낫토, 계란, 무순, 고추',
		'계란',
		0,
		7000,
		NULL
	),
	(
		37,
		3,
		'16.png',
		'호르몬 모츠나베',
		'곱창전골 (745 kcal)',
		'돼지 내장, 배추, 부추, 어묵, 숙주, 고추',
		'돼지고기',
		0,
		15000,
		NULL
	),
	(
		38,
		3,
		'17.png',
		'연어구이',
		'노르웨이 연어 구이 (456 kcal)',
		'연어, 레몬, 생강',
		'없음',
		0,
		11000,
		NULL
	),
	(
		39,
		3,
		'18.png',
		'고등어구이 1/2',
		'소금에 절인 고등어구이 (356 kcal)',
		'고등어, 레몬, 생강',
		'고등어',
		0,
		9000,
		NULL
	),
	(
		40,
		4,
		'1.png',
		'콜라',
		'코카콜라 (92 kcal)',
		' ',
		' ',
		0,
		3000,
		NULL
	),
	(
		41,
		4,
		'2.png',
		'사이다',
		'스프라이트 (160 kcal)',
		' ',
		' ',
		0,
		3000,
		NULL
	),
	(
		42,
		4,
		'3.png',
		'닥터페퍼',
		'닥터테퍼 (212 kcal)',
		' ',
		' ',
		0,
		5000,
		NULL
	),
	(
		43,
		4,
		'4.png',
		'환타',
		'환타 (136 kcal)',
		' ',
		' ',
		0,
		3000,
		NULL
	),
	(
		44,
		5,
		'1.png',
		'일본주',
		'고급적이고 부드러운 일본주',
		' ',
		' ',
		0,
		100000,
		NULL
	),
	(
		45,
		5,
		'2.png',
		'사케',
		'부드럽고 달콤한 온사케, 온사케 한잔으로 하루의 피로를 날려버리세요.',
		' ',
		' ',
		0,
		20000,
		NULL
	),
	(
		46,
		5,
		'3.png',
		'아사히 생맥주 500cc',
		'일본의 대표 맥주! 마시고 힘내세요',
		' ',
		' ',
		0,
		6000,
		NULL
	),
	(
		47,
		5,
		'4.png',
		'산토리 하이볼',
		' 연인에게 하이볼을 선물하세요. 달콤하고 부드러운 하이볼',
		' ',
		' ',
		0,
		8000,
		NULL
	),
	(
		48,
		5,
		'5.png',
		'한라산 소주',
		'영감님이 좋아하는 소주! 한라산!',
		' ',
		' ',
		0,
		6000,
		NULL
	),
	(
		49,
		5,
		'6.png',
		'히비키 위스키',
		'일본의 부드러운 대표 위스키 히비키와 함께 술의 세상으로 여행을 떠나요.',
		' ',
		' ',
		0,
		120000,
		NULL
	);

CREATE TABLE
	IF NOT EXISTS `ordertable` (
		`orderNumber` int (11) NOT NULL AUTO_INCREMENT,
		`orderHistory` longtext CHARACTER
		SET
			utf8mb4 COLLATE utf8mb4_bin NOT NULL,
			`membershipNumber` char(20) DEFAULT NULL,
			`orderTime` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
			`totalPrice` int (11) NOT NULL,
			PRIMARY KEY (`orderNumber`),
			KEY `membershipNumber` (`membershipNumber`)
	) ENGINE = InnoDB AUTO_INCREMENT = 410 DEFAULT CHARSET = utf8mb4 COLLATE = utf8mb4_general_ci;

INSERT INTO
	`ordertable` (
		`orderNumber`,
		`orderHistory`,
		`membershipNumber`,
		`orderTime`,
		`totalPrice`
	)
VALUES
	(
		285,
		'[1]',
		'010-2222-2222',
		'2023-04-03 05:43:42',
		10000
	),
	(
		286,
		'[1]',
		'010-2222-2222',
		'2023-04-03 05:44:28',
		10000
	),
	(
		287,
		'[1]',
		'010-5555-5555',
		'2023-04-05 05:46:16',
		10000
	),
	(
		288,
		'[2]',
		'010-2222-2222',
		'2023-04-05 05:47:00',
		14000
	),
	(289, '[3]', '', '2023-04-05 05:47:24', 10000),
	(
		290,
		'[6]',
		'010-9500-9987',
		'2023-04-06 05:48:34',
		16000
	),
	(291, '[5]', '', '2023-04-06 05:50:18', 12000),
	(
		292,
		'[1]',
		'010-9500-9987',
		'2023-04-06 05:50:50',
		10000
	),
	(293, '[5]', '', '2023-04-06 05:50:59', 12000),
	(294, '[4]', '', '2023-04-06 05:51:37', 14000),
	(
		295,
		'[2]',
		'010-9500-9987',
		'2023-04-06 05:51:39',
		14000
	),
	(296, '[1]', '', '2023-04-06 05:52:48', 10000),
	(
		361,
		'[2]',
		'010-2222-2222',
		'2023-04-06 07:12:38',
		14000
	),
	(363, '[6]', '', '2023-04-06 07:13:31', 16000),
	(364, '[23]', '', '2023-04-06 07:15:06', 8000),
	(
		365,
		'[22,23,27,30,33]',
		'010-2222-2222',
		'2023-04-06 07:16:20',
		39000
	),
	(373, '[42,41]', '', '2023-04-06 07:46:31', 8000),
	(
		382,
		'[40,43,41,42]',
		'010-2222-2222',
		'2023-04-06 07:54:26',
		14000
	),
	(
		383,
		'[41,41]',
		'010-2222-2222',
		'2023-04-06 07:55:17',
		23000
	),
	(387, '[]', '', '2023-04-06 08:07:52', 6000),
	(388, '[1,1]', '', '2023-04-06 08:12:06', 130000),
	(389, '[1]', '', '2023-04-06 08:12:31', 10000),
	(
		390,
		'[3,46,49]',
		'010-9500-9987',
		'2023-04-06 08:17:20',
		136000
	),
	(391, '[1,3,2]', '', '2023-04-06 08:17:41', 34000),
	(
		392,
		'[44,47,45,48,46,49]',
		'',
		'2023-04-06 08:18:13',
		260000
	),
	(393, '[3]', '', '2023-04-06 08:35:55', 10000),
	(394, '[3]', '', '2023-04-06 08:36:30', 10000),
	(395, '[3]', '', '2023-04-06 08:38:07', 10000),
	(396, '[3]', '', '2023-04-06 08:38:12', 10000),
	(397, '[1]', '', '2023-04-06 08:38:16', 10000),
	(398, '[2]', '', '2023-04-06 08:39:18', 14000),
	(399, '[3]', '', '2023-04-06 08:40:21', 10000),
	(400, '[1]', '', '2023-04-06 08:41:54', 10000),
	(
		401,
		'[2,2,2,2,6,6,6,6,6]',
		'010-2222-2222',
		'2023-04-06 08:47:36',
		136000
	),
	(402, '[1,5]', '', '2023-04-06 08:52:40', 22000),
	(
		403,
		'[22,22,22,22,22,22,22,22,22,22,22,22,22,22,25,25,25,25,25,25,25,25,25,25,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,26,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,24,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27,27]',
		'010-2222-2222',
		'2023-04-06 09:52:11',
		1661000
	),
	(
		404,
		'[46,45,44,48,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,47,5]',
		'010-2222-2222',
		'2023-04-06 09:59:14',
		4592000
	),
	(
		405,
		'[6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5]',
		'010-2222-2222',
		'2023-04-06 10:00:42',
		1330000
	),
	(
		406,
		'[49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49]',
		'010-2222-2222',
		'2023-04-06 10:02:06',
		23160000
	),
	(407, '[4]', '', '2023-04-06 10:09:16', 14000),
	(
		408,
		'[15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,15,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49]',
		'010-2222-2222',
		'2023-04-06 10:10:18',
		23722000
	),
	(
		409,
		'[49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49,49]',
		'',
		'2023-04-06 10:15:45',
		4680000
	);